#include <iostream>
using namespace std;

int main()
{
    int i=5, j=10; //ცვლადების აღწერა, რომელზეც მიუთითებს მიმთითებელი.
    int *p; //მიმთითებელი თვითონაც არის ცვლადი. მას უნდა ჰქონდეს იგივე ტიპი 
            //რაც აქვს ცვლადს რომელზეც უთითებს.
    int **q; //მიმთითებელი მიმთითებელზე        
    /*
    ასეთი ჩანაწერი არ იმუშავებს, რადგან კომპილატორი
    მოელის ჩვეულებრივ ცვლადზე მითითებას და არა მიმთითებელზე.
    int *q;
    q = &p;
    */
    p = &i;
    cout <<"&i = "<<&i<<endl; //ცვლადის მისამართი მეხსიერებაში, შეგვიძლია გამოვიყენოთ
                              //მიმთითებლისგან დამოუკიდებლად.
    cout <<"p = "<<p<<endl; //მიმთითებელში ჩაწერილი მნიშვნელობა
    cout <<"&p = "<<&p<<endl; //პოინტერს ანუ მიმთითებელსაც გააჩნია თავისი მისამართი
    q = &p;
    cout <<"&q = "<<q<<endl;

    return 0;
}
