#include <iostream>
using namespace std;

int faqtoriali(int p)
{
   int i,k=1;
   for (i=1;i<=p;i++)
	k=k*i;
   return k;

}

void cvlileba(int *a, int *b) //ეს ფუნქცია არ აბრუნებს არაფერს, მისი საშუალებით ხდება ცვლადების მნიშვნელობების გაცვლა
			     // ცვლადების მნიშნელობების გაცვლა ხორციელდება მეხსიერებაში მათი მისამართების გამოყენებით
			     // ამ ფუნქციას აქვს ორი არგუმენტი - ორივე არის მიმთითებელი მთელი ტიპის ცვლადებზე
{
  int c;  //c არის დამხმარე ცვლადი, სადაც ვინახავთ გასაცვლელ მნიშვნელობას დროებით
  c = *a; //c-ში შენახულია იმ ცვლადის მნიშვნელობა, რომელიც გადაცემულია პირველ არგუმენტად
  *a = *b; //პირველ არგუმენტში ჩაწერილ მნიშვნელობას ვანაცვლებთ მეორე არგუმენტში ჩაწერილი მნიშვნელობით
  *b = c; //მეორე არუგმენტში ვწერთ დროებით ცვლადში შენახულ მნიშვნელობას - რაც არის პირველი არგუმენტის მნიშვნელობა
}

int main()
{
   int a, b;
   a = 7;
   b = faqtoriali(a);
   cout<<"a="<<a<<" b="<<b<<endl;
   cvlileba(&a,&b);
   cout<<"a="<<a<<" b="<<b<<endl;
   return 0;
}
