/*
დაწერეთ პროგრამა რომელიც დღეებს გადაიყვანს, წლებში, კვირებში და დღეებში.
პროგრამამ მომხმარებელს უნდა მოთხოვოს დღეების რაოდენობის შეტანა, ხოლო
პროგრამამ უნდა დაითვალოს რამდენი წელი, კვირა და დღე გამოდის შეტანილი
რიცხვიდან. დღეების მოცემულ რაოდენობაში წლების,კვირებისა და დღეების
დასათვლელად გამოიყენეთ ფუნქცია, ან ფუნქციები.
მაგალითი:
თუ მომხმარებელმა შეიტანა 373, თქვენმა პროგრამამ უნდა დაბეჭდოს 1 წელი, 1 კვირა
და 1 დღე, რადგან წელიწადში არის 365 დღე (ნუ მივაქცევთ ყურადღებას ნაკიანობას), 1
კვირაში არის 7 დღე, შესაბამისად 373 = 1 წელი (365 დღე) + 1 კვირა (7 დღე) + 1 დღე (5
ქულა)
*/
#include <iostream>
using namespace std;

int main()
{
    static int days_in_week = 7, days_in_year = 365;
    int days, weeks, years;
    cout<<"გთხოვთ შემოიტანოთ დღეების რაოდენობა"<<endl;
    cin>>days;
    years = days / days_in_year;
    weeks = (days % days_in_year) / days_in_week;
    cout<<days<<"-ში არის "<<years<<" წელი, "<<weeks<<" კვირა და "<< (days % days_in_year) % days_in_week<<" დღე "<<endl;
    return 0;
}