/*
დაწერეთ პროგრამა, რომელიც მომხმარებელს მოსთხოვს რიცხვის შემოტანას, თუ ეს
რიცხვი არის 1-ზე მეტი ან ტოლი და 9-ზე ნაკლები ან ტოლი, მაშინ დაწერეთ ამ რიცხვის
შესაბამისი სიტყვიერი მნიშვნელობა, მაგალითად თუ მომხმარებელი შემოიტანს 4-ს
პროგრამამ უნდა დაბეჭდოს „ოთხი“, ხოლო თუ რიცხვი არის 9-ზე მეტი მაშინ
პროგრამამ უნდა დაბეჭდოს „რიცხვი 9-ზე მეტია“, ხოლო თუ რიცხვი იქნება უარყოფითი,
პროგრამამ უნდა დაბეჭდოს „უარყოფით რიცხვებს არ ვაანალიზებთ.“ 
*/
#include <iostream>
#include <string>
using namespace std;

int main()
{
    int n;
    string numbers[10] = {"ნული","ერთი","ორი","სამი","ოთხი","ხუთი","ექვსი","შვიდი","რვა","ცხრა"};
    cout<<"შემოიტანეთ რიცხვი"<<endl;
    cin>>n;
    if(n<0)
    {
        cout<<"უარყოფით რიცხვებს არ ვაანალიზებთ"<<endl;
    }
    else if (n>9)
    {
        cout<<"რიცხვი მეტია 9-ზე"<<endl; 
    }
    else 
    {
        cout<<numbers[n]<<endl;
    }
    return 0;
}