/* 
შექმენით ორი მთელი რიცხვების ვექტორი, რომელშიც იქნება 10 ელემენტი.
განსაზღვრეთ ამ ვექტორების ელემენტები ვექტორის აღწერისას { } ფრჩხილებში, ელემენტების ჩამოთვლით.
დაადგინეთ ამ ვექტორებში, რომელია საერთო ელემენტი და რომელია ისეთი, რომელიც მხოლოდ ერთ-ერთ ვექტორშია,
ასეთ ელემენტებს, რომლებიც მხოლოდ ერთ ან მეორე ვექტორშია დავარქვათ უნიკალური ელემენტები. 
მას შემდეგ რაც დაადგენთ უნიკალურ ელემენტებს, პირველ ვექტორში ჩაწერეთ ყველა ის რიცხვი,
რომელიც არ არის უნიკალური ხოლო მეორე ვექტორში გადაიტანეთ ყველა ის რიცხვი რომელიც უნიკალურია.
*/
#include <iostream>
#include <vector>
using namespace std;

int main()
{
    vector<int> v1 {-7, -6,-5,-4,-3,-2,-1,0, 1, 2 };
    vector<int> v2 {0, 1, 2, 3, 4, 5, 6 ,7 ,8 ,9 };
    vector<int> v3, v4;
    bool t;
    for (auto e1 : v1)
    {
        for (auto e2 : v2)
            {
                if (e1!=e2)
                {
                    t = true;
                }
                else
                {
                    t = false;
                    break;
                }
            }
        if (t)
            {
                v3.push_back(e1);
            }
        else
        {
            v4.push_back(e1);
        }
    }
    for ( auto e2: v2)
    {
        for (auto e4: v4)
        {
            if (e2!=e4)
            {
                t = true;
            }
            else 
            {
                t = false;
                break;
            }
        }
        if (t) 
        {
            v3.push_back(e2);
        }
        else
        {
            continue;
        }
    }
    cout<<"უნიკალური ელემენტები"<<endl;
    for (auto e : v3)
    {
        cout<<e<<" ";
    }
    cout<<endl;
    cout<<"მსგავსი ელემენტები"<<endl;
    for (auto e : v4)
    {
        cout<<e<<" ";
    }
    cout<<endl;

    return 0;
}