#include <iostream>
using namespace std;
//შაბლონური ფუნქციას აქვს შეზღუდვა - მას არ შეუძლია მიიღოს შერეული ტიპის
//არგუმენტები, მაგალითად თუ გვაქვს შაბლონი T და შაბლონური ფუნქციას
//ვაწვდით T ტიპის ორ არგუმენტს, სადაც გადაცემული მნიშვნელობების ტიპები 
//ერთმანეთისგან განსხვავდება მაშინ მივიღებთ შეცდომას
//ამ პრობლემის მოგვარება ხდება დამატებითი შაბლონური ტიპის შექმნით

//შაბლონური ფუნქციის აღწერა შერეული ტიპის ცვლადებისთვის
template <typename T1, typename T2>
T1 sum(T1 a, T2 b)
{
    cout<<a<<endl;
    cout<<b<<endl;
    return a;
}

int main()
{
    cout<<"მთელი ტიპის რიცხვები შეკრება - 5, 6.2 "<<sum(5, 6.2)<<endl; 
    cout<<"წილადი ტიპის რიცხვების შეკრება - 4.2, 3.4 "<<sum(4.2, 3)<<endl;
    return 0;
}
