#include <iostream>
using namespace std;
//შაბლონური ფუნქციას აქვს შეზღუდვა - მას არ შეუძლია მიიღოს შერეული ტიპის
//არგუმენტები, მაგალითად თუ გვაქვს შაბლონი T და შაბლონური ფუნქციას
//ვაწვდით T ტიპის ორ არგუმენტს, სადაც გადაცემული მნიშვნელობების ტიპები 
//ერთმანეთისგან განსხვავდება მაშინ მივიღებთ შეცდომას

//შაბლონური ფუნქციის აღწერა
template <typename T>
T sum(T a, T b)
{
    return a+b;
}

int main()
{
    cout<<"მთელი ტიპის რიცხვები შეკრება - 5, 6.2 "<<sum(5,6.2)<<endl; //მოგვცემს შეცდომას
    cout<<"წილადი ტიპის რიცხვების შეკრება - 4.2, 3.4 "<<sum(4.2,3.4)<<endl;
    return 0;
}
