#include <iostream>
using namespace std;
//ამ შემთხვევაში ობიექტის ცვლადების ინიციალიზაციისთვის არ ხდება კონსტრუქტორის გამოყენება
class samp
	{
		int a; //დახურული/შიდა ტიპის ცვლადი, private-ის მიწერა არ არის საჭირო
			   //როდესაც შემდგომ გვაქვს public ტიპის ცვლადები.
		public:
			int set_a(int n) { a=n; } //ღია ტიპის მეთოდი, რომლის საშუალებითაც მნიშვნელობას ვანიჭებთ დახურული ტიპის ცვლადს
			int get_a() { return a; } //ღია ტიპის მეთოდი, რომელის საშუალებითაც ვაბრუნებთ დახურული ტიპის ცვლადზე მინიჭებულ მნიშვნელობას

	};

int main()
	{
		samp obj[5]; //აქ იქმნება 5 ელემნტიანი ობიექტების მასივი
		int i;

		for(i=0; i<5; i++)
			obj[i].set_a(i+14); //აქ ხდება თითოეული ობიექტისთვის დახურული ტიპის ცვლადის მნიშვნელობის მინიჭება

		for(i=0; i<5; i++)
			cout<<obj[i].get_a()<<endl; //აქ ხდება თითოეული ობიექტისთვის დახურული ტიპის ცვლადის მნიშვნელობის დაბეჭდვა

		return 0;
	}
