#include <iostream>
using namespace std;
//ამ შემთხვევაში ობიექტის ცვლადების ინიციალიზაციისთვის არ ხდება კონსტრუქტორის გამოყენება
class samp
	{
		int a; //დახურული/შიდა ტიპის ცვლადი, private-ის მიწერა არ არის საჭირო
			   //როდესაც შემდგომ გვაქვს public ტიპის ცვლადები.
		public:
			samp(int n) { a=n; } //კონსტრუქტორის საშუალებით ვანიჭებთ მნიშვნელობას დახურული ტიპის ცვლადს - ანუ ვაკეთებთ ობიექტის ინიციალიზაციას
			int get_a() { return a; } //ღია ტიპის მეთოდი, რომელის საშუალებითაც ვაბრუნებთ დახურული ტიპის ცვლადზე მინიჭებულ მნიშვნელობას

	};

int main()
	{
		samp obj[5] = {1,2,3,4,5}; //5 ელემნტიანი ობიექტების მასივის შექმნა კონსტრუქტორის გამოყენებით
		int i;

		for(i=0; i<5; i++)
			cout<<obj[i].get_a()<<endl; //აქ ხდება თითოეული ობიექტისთვის დახურული ტიპის ცვლადის მნიშვნელობის დაბეჭდვა

		return 0;
	}
