/*
 *შექმენით ფუნქცია, რომელიც არც ერთი არგუმენტის მიღების შემთხვევაში დაბეჭდავს "ეს არის ცარიელი ფუნქცია",
 *გადატვირთეთ ფუნქცია ერთი არგუმენტის გამოყენებით, ეს არგუმენტი უნდა იყოს სტრიქონული ტიპის, თუ სტრიქონის
 *ტიპის სიგრძე კენტია, მაშინ უნდა გამოიძახოთ ფუნქცია, რომელიც დაბეჭდავს სტრიქონს და შემდეგ ტექსტს:
 *"სტრიქონული ტიპის ცვლადი შეიცავს კენტი რაოდენობის სიმბოლოებს", თუ სტრიქონის სიგრძე ლუწია, ამ შემთხვევაში
 *უნდა მოხდეს მისი ჩამატება ვექტორში. გადატვირთეთ ფუნქცია ორი ცვლადით, სადაც ორივე უნდა იყოს სტრიქონული ტიპის,
 *თუ ამ სტრიქონული ტიპის ცვლადებში სიმბოლოების ჯამური რაოდენობა კენტია, მაშინ ეს ცვლადები უნდა დაემატოს იგივე
 *ვექტორს რაც წინა გადატვირთვის შემთხვევაში, ხოლო თუ ჯამი ლუწია, მაშინ ფუნქციამ უნდა დაბეჭდოს "გადაცემული
 *სტრიქონული ტიპის ცვლადებში, სიმბოლოების ჯამური რაოდენობა ლუწია".
 */

#include <iostream>
#include <vector>
#include <string>
using namespace std;

vector<string> v;

void print_the_function(const string& arg1)
{
	cout<<arg1<<" სტრიქონული ტიპის ცვლადი შეიცავს კენტი რაოდენობის სიმბოლოებს"<<endl;
}

void the_function()
{
	cout<<"ეს არის ცარიელი ფუნქცია"<<endl;
}

void the_function(const string& arg1)
{
	if (arg1.length()/2==0)
		{
			v.push_back(arg1);
		}
	else
		{
			print_the_function(arg1);
		}
}

void the_function(const string& arg1, const string& arg2)
{
	string the_string;
	the_string = arg1 + arg2;
	if (the_string.length()/2==0)
		{
			cout<<"გადაცემული სტრიქონული ტიპის ცვლადებში, სიმბოლოების ჯამური რაოდენობა ლუწია"<<endl;
		}
	else
		{
			v.push_back(arg1);
			v.push_back(arg2);
		}
}

int main()
{
	the_function();
	the_function("The test string");
	the_function("The","test string");
	return 0;
}

