#include <iostream>
using namespace std;

int main()
{
	int a[5]={1,2,3,4,5};
	//დავბეჭდოთ მასივის ელემენტები
	cout<<"მასივის ელემენტები"<<endl;
	for (int i=0; i<5; i++)
		cout<<a[i]<<endl;
	cout<<endl<<"მიმთითებლები მასივის ელემენტებზე"<<endl;
	int *p;
	p = &a[0];
	cout<<*p<<endl;
	p++;
	cout<<*p<<endl;
	//ბოლო ელემენტის წაკითხვა ინდექსის გამოყენების გარეშე
	p+=3;
	cout<<*p<<endl;
	//მასივში ელემენტების რაოდენობის დათვლა
	//sizeof ფუნქცია ითვლის თუ მეხსიერების რა მოცულობა უკავია
	//ცვლადს ან მასივს.
	//იმისთვის რომ დავადგინოთ მასივის ელემენტების რაოდენობა
	//საჭიროა მასივის საერთოდ დაკავებული მეხსიერების მოცულობა sizeof(a) გავყოთ
	//მასივის ერთი ელემნტის მიერ დაკავებულ მეხსიერების მოცულობაზე 
	cout<<"მასივში ელემენტების რაოდენობის დათვლა "<<sizeof(a)/sizeof(a[0])<<endl;
	return 0;
}
