#include <iostream>
using namespace std;

int main()
{
  int *i; //და int* i ჩანაწერი არის ეკვივალენტური
          //*i გამოიყენება int ტიპის ცვლადის მისამართის შესანახად
          //და ეწოდება მიმთითებელი ცვლადზე
  int a;
  i = &a; //& გვაძლევს a ცვლადის მისამართს მეხსიერებაში
  cout<<"address of a ="<<i<<endl;
  a=10;
  cout<<"a="<<a<<endl;
  *i = 20;
  cout<<"a="<<a<<endl;
  //დავბეჭდოთ მიმთითებლის მისამართი
  //ამისთვის გვჭირდება შევქმნათ მიმთითებლის მიმთითებელი
  int **pi;
  pi = &i;
  cout<<"მიმთითებელი i-ს მისამართი მეხსიერებაში "<<pi<<endl;
  int ***ppi;
  ppi = &pi;
  cout<<"მიმთითებლის მიმთითებლის pi-ს მისამართი მეხსიერებაში "<<ppi<<endl;
  //იმისთვის რომ მიმთითებელზე მიმთითებლის გამოყენებით წავიკითხოთ პირველად ცვლადში ჩაწერილი მნიშვნელობა
  //უნდა გამოვიყენოთ გაფრცქვნის ოპერაცია
  cout<<"***pi ოპერაციამ უნდა გამოიტანოს პირველი ცვლადის მნიშვნელობა ანუ 20 - "<<***ppi<<endl;
  return 0;
}

